<h1> 파일 불러오기

In [2]:
import pandas as pd
import numpy as np

In [12]:
pd.read_csv('C:/pro_baseball.csv', encoding="cp949")

     연도     넥센     두산     롯데     삼성     한화    KIA     KT     LG     NC     SK
0  2013  0.571  0.568  0.532  0.595  0.331  0.408    NaN  0.578  0.419  0.496
1  2014  0.619  0.465  0.457  0.624  0.389  0.422    NaN  0.492  0.551  0.484
2  2015  0.545  0.549  0.462  0.611  0.472  0.465  0.364  0.451  0.596  0.486
3  2016  0.538  0.650  0.458  0.455  0.468  0.490  0.373  0.500  0.589  0.479
4  2017  0.486  0.596  0.563  0.396  0.430  0.608  0.347  0.489  0.560  0.524
5  2018  0.521  0.646  0.479  0.486  0.535  0.486  0.418  0.476  0.406  0.545

In [15]:
df_body = pd.DataFrame({'Weight': [72, 77, 52, 69],
                       'Height': [175, 182, 163, 170]},
                       index=['Yoon', 'Kwon', 'Shin', 'Kim'])
df_body

      Weight  Height
Yoon      72     175
Kwon      77     182
Shin      52     163
Kim       69     170

In [17]:
df_body.index.name='User'
df_body

      Weight  Height
User
Yoon      72     175
Kwon      77     182
Shin      52     163
Kim       69     170

In [19]:
bmi = df_body['Weight']/(df_body['Height']/100)**2
bmi

User
Yoon    23.510204
Kwon    23.245985
Shin    19.571681
Kim     23.875433
dtype: float64

In [21]:
df_body['bmi'] = bmi
df_body

      Weight  Height        bmi
User
Yoon      72     175  23.510204
Kwon      77     182  23.245985
Shin      52     163  19.571681
Kim       69     170  23.875433

In [28]:
df_body.to_csv('C:/Users/admin/Desktop/body.csv')